#!/bin/bash

#-------------------------------------------------------------------------------------
# Переменная "bdir" указывает путь к дирректории, в которую будет сохраняться Backup
#
# Пример: export bdir="/home/user/backup/"
#-------------------------------------------------------------------------------------

export bdir="/home/alex/eltex/git/"

#-------------------------------------------------------------------------------------
# Переменная "files" указывает путь к файлу, для которого требуется выполнять Backup
#
# Пример: export files="/home/user/file_to_backup.txt"
#-------------------------------------------------------------------------------------

export files="/home/alex/file"

#-------------------------------------------------------------------------------------
# Переменная "method" содержит код, определяющий метод выполнения Backup`a
# Возможные варианты: [1] - tar;
#		      [2] - dd; 
#		      [3] - git;
#
# Пример: export method="1" # Backup методом tar
#-------------------------------------------------------------------------------------

export method="3" 

#-------------------------------------------------------------------------------------
# Переменные minute,hour,dayofweek,month и day, определяют, в какое 
# время и с какой периодичностью будет выполняться backup.
# присвоение одной из переменных значения '*', означает, что backup будет 
# выполняться при каждом изменении параметра, соответствующего этой переменной.
# Например, hour='*' означает, что backup выполняется каждый час.
# 
# Пример установки времени выолнения:
# ................................................
# export minute=0
# export hour=12
# export dayofweek=*
# export month=*
# export day=*
# 
# Backup будет выполняться каждый день в 12:00;
#
# ................................................
# export minute=*
# export hour=*
# export dayofweek=*
# export month=*
# export day=*
# 
# Backup будет выполняться каждую минуту
#-------------------------------------------------------------------------------------

export minute=*
export hour=*
export dayofweek=*
export month=*
export day=*















